month = int(input(('Введите месяц в виде целого числа от 1 до 12: ')))
months = [None, "Январь", "Февраль", "Март", "Апрель", "Май", "Июнь", "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь",
          "Декабрь"]
months_dict = {"Январь": "Зима", "Февраль": "Зима", "Март": "Весна", "Апрель": "Весна", "Май": "Весна",
               "Июнь": "Лето", "Июль": "Лето", "Август": "Лето", "Сентябрь": "Осень", "Октябрь": "Осень",
               "Ноябрь": "Осень",
               "Декабрь": "Зима"}
print(f"Месяц {months[month]}. Время года {months_dict.get(months[month])}")
